//-----------------------------------------------------------------------------
// File : ImGuiRingMenu.h
// Desc : ImGui Ring Menu.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <string>
#include <vector>


#ifndef ImTextureID
typedef uint64_t ImTextureID;
#endif//ImTextureID

#ifndef RING_API
#define RING_API
#endif//RING_API

#ifndef RING_APIENTRY
#define RING_APIENTRY __stdcall
#endif//RING_APIENTRY


///////////////////////////////////////////////////////////////////////////////
// ImGuiRingMenu class
///////////////////////////////////////////////////////////////////////////////
class ImGuiRingMenu
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    ///////////////////////////////////////////////////////////////////////////
    // MenuItem structure
    ///////////////////////////////////////////////////////////////////////////
    struct RING_API MenuItem
    {
        ImTextureID     Icon;   //!< メニューアイコン.
        std::string     Label;  //!< 表示文字列.
    };

    ///////////////////////////////////////////////////////////////////////////
    // Config structure
    ///////////////////////////////////////////////////////////////////////////
    struct RING_API Config
    {
        int KeyMenuOpen     = 519;/* ImGuiKey_Home  */  //!< メニュー開始キー.
        int KeyMenuClose    = 519;/* ImGuiKey_Home  */  //!< メニュー終了キー.
        int KeyMenuSelect   = 525;/* ImGuiKey_Enter */  //!< 決定キー.
        int KeyCwRotate     = 514;/* ImGuiKey_Right */  //!< 時計回り回転キー.
        int KeyCcwRotate    = 513;/* ImGuiKey_Left  */  //!< 反時計周り回転キー.

        float       AnimSpeed           = 6.0f;         //!< アニメーションスピード.
        float       IconSize            = 64.0f;        //!< アイコンサイズ.
        uint32_t    ColorBezel          = 0xFFFF0000;   //!< 選択枠カラー.
        uint32_t    ColorSelectedLabel  = 0x0000FFFF;   //!< 選択中カラー.
        uint32_t    ColorDefaultLabel   = 0x00FFFFFF;   //!< ラベルカラー.
    };

    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    RING_API RING_APIENTRY ImGuiRingMenu();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    RING_API RING_APIENTRY ~ImGuiRingMenu();

    //-------------------------------------------------------------------------
    //! @brief      指定されたメニュー項目を追加します.
    //! 
    //! @param[in]      item        追加する項目.
    //-------------------------------------------------------------------------
    RING_API void RING_APIENTRY Add(const MenuItem& item);

    //-------------------------------------------------------------------------
    //! @brief      指定されたメニュー項目を削除します.
    //! 
    //! @param[in]      index       削除する項目番号.
    //-------------------------------------------------------------------------
    RING_API void RING_APIENTRY Remove(uint32_t index);

    //-------------------------------------------------------------------------
    //! @brief      メニュー項目を全削除します.
    //-------------------------------------------------------------------------
    RING_API void RING_APIENTRY Clear();

    //-------------------------------------------------------------------------
    //! @brief      アニメーション更新を行います.
    //! 
    //! @param[in]      deltaSec        前フレームからの差分時間(秒単位).
    //-------------------------------------------------------------------------
    RING_API void RING_APIENTRY Update(float deltaSec);

    //-------------------------------------------------------------------------
    //! @brief      描画処理を行います.
    //! 
    //! @param[in,out]  selectedIndex   選択されているメニュー番号.
    //! @return     メニューが選択された true を返却します.
    //-------------------------------------------------------------------------
    RING_API bool RING_APIENTRY Draw(int& selectedIndex);

    //-------------------------------------------------------------------------
    //! @brief      コンフィグを設定します.
    //! 
    //! @param[in]      value       設定する値.
    //-------------------------------------------------------------------------
    RING_API void RING_APIENTRY SetConfig(const Config& value);

    //-------------------------------------------------------------------------
    //! @brief      コンフィグを取得します.
    //! 
    //! @return     コンフィグを返却します.
    //-------------------------------------------------------------------------
    RING_API const Config& RING_APIENTRY GetConfig() const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    std::vector<MenuItem> m_Items;      //!< メニューアイテムリスト.

    int     m_SelectedId    = 0;        //!< 選択されている番号.
    float   m_CurrentAngle  = 0.0f;     //!< 現在の回転角.
    float   m_TargetAngle   = 0.0f;     //!< 目標とする回転角.
    float   m_AnimProgress  = 0.0f;     //!< アニメーション進捗率[0, 1].
    uint8_t m_State         = 0;        //!< アニメーションステート.
    Config  m_Config        = {};       //!< コンフィグ.

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};
